# Lab | Data Cleaning and Formatting

Objective: Apply Python programming to perform data cleaning and formatting, including identifying and handling with missing values, duplicates, outliers, errors, and using various formatting techniques such as changing data types, renaming columns, and handling string values, to prepare data for analysis.

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

In [1]:
import pandas as pd
import numpy as np

data = pd.read_csv('./file1.csv')

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

In [2]:
data.columns

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')

In [3]:
# We change the name of column 'ST' to 'State' for it to be more informative.
data = data.rename(columns={'ST':'State'})

In [4]:
# We put all column names in lower case for purposes of ease of use.

data.columns = [col.lower() for col in data.columns]

In [5]:
data.columns

Index(['customer', 'state', 'gender', 'education', 'customer lifetime value',
       'income', 'monthly premium auto', 'number of open complaints',
       'policy type', 'vehicle class', 'total claim amount'],
      dtype='object')

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they contain only valid data. For example, the gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized.

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

In [6]:
# 
data

,customer,state,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
4003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
data.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer lifetime value       object
income                       float64
monthly premium auto         float64
number of open complaints     object
policy type                   object
vehicle class                 object
total claim amount           float64
dtype: object

In [8]:
# First, we are going to address categorical values.
# We show unique values of gender.
data['gender'].value_counts(dropna=False)

NaN       3054
F          457
M          413
Male        39
female      28
Femal       17
Name: gender, dtype: int64

In [9]:

data['gender'] =  data['gender'].astype(str)

In [10]:
# We clean gender values.

def clean(x):
    if x in ['M', 'Male']:
        return 'Male'
    elif x.startswith('F'):
        return 'Female'
    elif x.startswith('f'):
        return 'Female'
    else:
        return np.nan

data['gender'] = list(map(clean, data['gender']))

In [11]:
data['gender'].value_counts(dropna=False)

NaN       3054
Female     502
Male       452
Name: gender, dtype: int64

In [12]:
# We show unique values of state.
data['state'].value_counts(dropna=False)

NaN           2937
Oregon         320
California     211
Arizona        186
Cali           120
Nevada          98
Washington      81
WA              30
AZ              25
Name: state, dtype: int64

In [13]:
# We clean state values.

def clean_state(x):
    if x in ['WA']:
        return 'Washington'
    elif x in ['Cali']:
        return 'California'
    elif x in ['AZ']:
        return 'Arizona'
    else:
        return x
    
data['state'] = list(map(clean_state, data['state']))

In [14]:
data['state'].value_counts(dropna=False)

NaN           2937
California     331
Oregon         320
Arizona        211
Washington     111
Nevada          98
Name: state, dtype: int64

In [15]:
data['education'].value_counts(dropna=False)

NaN                     2937
Bachelor                 324
College                  313
High School or Below     296
Master                    94
Doctor                    37
Bachelors                  7
Name: education, dtype: int64

In [16]:
# We clean education values.

data['education']=data['education'].str.replace('Bachelors', 'Bachelor')
data['education'].value_counts(dropna=False)

NaN                     2937
Bachelor                 331
College                  313
High School or Below     296
Master                    94
Doctor                    37
Name: education, dtype: int64

In [17]:
data['policy type'].value_counts(dropna=False)

# Policy type values are fine.

NaN               2937
Personal Auto      780
Corporate Auto     234
Special Auto        57
Name: policy type, dtype: int64

In [18]:
data['vehicle class'].value_counts(dropna=False)

# Vehicle class values seem fine.

NaN              2937
Four-Door Car     576
Two-Door Car      205
SUV               199
Sports Car         57
Luxury SUV         20
Luxury Car         14
Name: vehicle class, dtype: int64

In [19]:
# Now we address numerical values that are seem invalid.

# We remove the "%" symbol from 'income' column in order to be able to change it to numeric.

data['customer lifetime value'] = data['customer lifetime value'].str.replace('%', '')
data['customer lifetime value'].value_counts(dropna=False)

NaN           2940
445811.34        4
251459.20        4
2412750.40       3
684615.03        3
              ...
1210120.88       1
245357.08        1
507566.27        1
321497.94        1
899704.02        1
Name: customer lifetime value, Length: 1028, dtype: int64

In [20]:
# We split number of open complaints column into three different columns. That way, we can see the values that are betwween slashs.
# One of the options (we would have to verify with the team dealing with the origin of the data) is that the number of open complaints is the number between the slahs.

data[['complaint_type1', 'complaint_type2', 'complaint_type3']] = data['number of open complaints'].str.split('/', expand=True)
data

,customer,state,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount,complaint_type1,complaint_type2,complaint_type3
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934,1,0,00
1,QZ44356,Arizona,Female,Bachelor,697953.59,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935,1,0,00
2,AI49188,Nevada,Female,Bachelor,1288743.17,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247,1,0,00
3,WW63253,California,Male,Bachelor,764586.18,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344,1,0,00
4,GA49547,Washington,Male,High School or Below,536307.65,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323,1,0,00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

In [21]:
data.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer lifetime value       object
income                       float64
monthly premium auto         float64
number of open complaints     object
policy type                   object
vehicle class                 object
total claim amount           float64
complaint_type1               object
complaint_type2               object
complaint_type3               object
dtype: object

In [22]:
# We change customer lifetime value to numeric

data['customer lifetime value'] =  pd.to_numeric(data['customer lifetime value'], errors='coerce')

In [23]:
# We do the same with the columns we created.

data['complaint_type1'] =  pd.to_numeric(data['complaint_type1'], errors='coerce')
data['complaint_type2'] =  pd.to_numeric(data['complaint_type2'], errors='coerce')
data['complaint_type3'] =  pd.to_numeric(data['complaint_type3'], errors='coerce')

In [24]:
data.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer lifetime value      float64
income                       float64
monthly premium auto         float64
number of open complaints     object
policy type                   object
vehicle class                 object
total claim amount           float64
complaint_type1              float64
complaint_type2              float64
complaint_type3              float64
dtype: object

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the isnull() function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (we haven't studied this yet)

Implement your chosen strategy to handle the null values. You can use the fillna() function in pandas to fill null values or dropna() function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the isnull() function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values.

After formatting data types, as a last step, convert all the numeric variables to integers using applymap.

Save the cleaned dataset to a new CSV file.

In [25]:
# 
data.isna().sum()

customer                     2937
state                        2937
gender                       3054
education                    2937
customer lifetime value      2940
income                       2937
monthly premium auto         2937
number of open complaints    2937
policy type                  2937
vehicle class                2937
total claim amount           2937
complaint_type1              2937
complaint_type2              2937
complaint_type3              2937
dtype: int64

In [26]:
rows_all_nan = data.isna().all(axis=1).sum()
print(rows_all_nan)

# We observe that there are 2937 rows of customer imputs that do not contain any info.

2937

In [27]:
# We decide to delete those rows.

data = data[data['customer'].isna()==False]

In [28]:
data.isna().sum()

#  Now we only have nan values in gender (117) and customer lifetime value columns.
#  We could replace customer lifetime values that equal zero with some data like the mean of the rest of the values of that column.
#  We think that by the moment it's not worthy since these are only 3 values out of 4008. We will replace them with zeros. As that, the whole column will contain numbers.

customer                       0
state                          0
gender                       117
education                      0
customer lifetime value        3
income                         0
monthly premium auto           0
number of open complaints      0
policy type                    0
vehicle class                  0
total claim amount             0
complaint_type1                0
complaint_type2                0
complaint_type3                0
dtype: int64

In [29]:
#  We replace this 3 nan values with 0.

data['customer lifetime value'] = data['customer lifetime value'].fillna(0)
data.isna().sum()

# Now we only have nan values in gender column.

C:\Users\dcast\AppData\Local\Temp\ipykernel_13084\3072014091.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['customer lifetime value'] = data['customer lifetime value'].fillna(0)

customer                       0
state                          0
gender                       117
education                      0
customer lifetime value        0
income                         0
monthly premium auto           0
number of open complaints      0
policy type                    0
vehicle class                  0
total claim amount             0
complaint_type1                0
complaint_type2                0
complaint_type3                0
dtype: int64

In [30]:
zero_values_columns = (data == 0).sum()
print(zero_values_columns)

# We also have zero values in income column.
# And we also have zero values in complaint_type2, but that seems fine (as the number of open complaints could be zero for some clients).
# We're going to address this two issues step by step. First, column gender and then, column income.

customer                        0
state                           0
gender                          0
education                       0
customer lifetime value         3
income                        252
monthly premium auto            0
number of open complaints       0
policy type                     0
vehicle class                   0
total claim amount              0
complaint_type1                 0
complaint_type2               830
complaint_type3              1071
dtype: int64

In [31]:
# We first fill nan values of gender column with bfill method.
# We prefer this method instead of the mode, because the mode will introduce a bias, as we would introduce the same value in all nan values.
# The best method would be to introduce new values in the same proportion as they are now in the column.
# But bfill (or ffill) method allows us to easily and quickly introduce values with some degree of randomness in the nan values.

data['gender']=data['gender'].fillna(method='bfill')

C:\Users\dcast\AppData\Local\Temp\ipykernel_13084\3222674818.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['gender']=data['gender'].fillna(method='bfill')

In [32]:
data.isna().sum()

#  Now we don't have any nan values left.

customer                     0
state                        0
gender                       0
education                    0
customer lifetime value      0
income                       0
monthly premium auto         0
number of open complaints    0
policy type                  0
vehicle class                0
total claim amount           0
complaint_type1              0
complaint_type2              0
complaint_type3              0
dtype: int64

In [33]:
#  Now we address the problem with the 252 zero values in income column.
#  In this case, we prefer to use the median rather than the mean, since the mean could be affected by the income values that are outliers.

income_median = data['income'].median()
data['income'] = data['income'].replace(0, income_median)

C:\Users\dcast\AppData\Local\Temp\ipykernel_13084\1838679757.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['income'] = data['income'].replace(0, income_median)

In [34]:
zero_values_columns = (data == 0).sum()
print(zero_values_columns)

customer                        0
state                           0
gender                          0
education                       0
customer lifetime value         3
income                          0
monthly premium auto            0
number of open complaints       0
policy type                     0
vehicle class                   0
total claim amount              0
complaint_type1                 0
complaint_type2               830
complaint_type3              1071
dtype: int64

In [35]:
data.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer lifetime value      float64
income                       float64
monthly premium auto         float64
number of open complaints     object
policy type                   object
vehicle class                 object
total claim amount           float64
complaint_type1              float64
complaint_type2              float64
complaint_type3              float64
dtype: object

In [37]:
# We convert just number values to integers.

def numbers_to_int(value):
    if isinstance(value, (int, float)):
        return int(value)
    else:
        return value
    
data = data.applymap(numbers_to_int)

In [38]:
data.dtypes

customer                     object
state                        object
gender                       object
education                    object
customer lifetime value       int64
income                        int64
monthly premium auto          int64
number of open complaints    object
policy type                  object
vehicle class                object
total claim amount            int64
complaint_type1               int64
complaint_type2               int64
complaint_type3               int64
dtype: object

In [39]:
data

,customer,state,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount,complaint_type1,complaint_type2,complaint_type3
0,RB50392,Washington,Female,Master,0,36234,1000,1/0/00,Personal Auto,Four-Door Car,2,1,0,0
1,QZ44356,Arizona,Female,Bachelor,697953,36234,94,1/0/00,Personal Auto,Four-Door Car,1131,1,0,0
2,AI49188,Nevada,Female,Bachelor,1288743,48767,108,1/0/00,Personal Auto,Two-Door Car,566,1,0,0
3,WW63253,California,Male,Bachelor,764586,36234,106,1/0/00,Corporate Auto,SUV,529,1,0,0
4,GA49547,Washington,Male,High School or Below,536307,36357,68,1/0/00,Personal Auto,Four-Door Car,17,1,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1066,TM65736,Oregon,Male,Master,305955,38644,78,1/1/00,Personal Auto,Four-Door Car,361,1,1,0
1067,VJ51327,California,Female,High School or Below,2031499,63209,102,1/2/00,Personal Auto,SUV,207,1,2,0
1068,GS98873,Arizona,Female,Bachelor,323912,16061,88,1/0/00,Personal Auto,Four-Door Car,633,1,0,0
1069,CW49887,California,Female,Master,462680,79487,114,1/0/00,Special Auto,SUV,547,1,0,0
1070,MY31220,California,Female,College,899704,54230,112,1/0/00,Personal Auto,Two-Door Car,537,1,0,0

In [40]:
# We save one first clean version of the data.

data.to_csv('file1_clean_day3_v0.csv', index=False)

## Exercise 5: Dealing with duplicates

Use the .duplicated() method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the drop_duplicates() function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using .duplicated().

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

In [78]:
# 
data.duplicated().value_counts()

# We don't find any duplicated rows.

False    1071
dtype: int64

# Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting. 

Write these functions in a separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [ ]:
# Function for renaming column names.

def rename_columns(data, column_dict):
    data = data.rename(columns=column_dict)
    return data

In [ ]:
# Function for putting column names in lower case.

def lowercase_column_names(data):
    data.columns = [col.lower() for col in data.columns]
    return data

# Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we tried to do work with that column, we wouldn't have been able to do it because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, lets get some more interesting insights!

Instructions:

- Review again the statistics for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the .describe() method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [79]:
data.describe().T

,count,mean,std,min,25%,50%,75%,max
customer lifetime value,1071.0,791466.547152,643944.688611,0.0,401975.0,584932.0,894520.5,5816655.0
income,1071.0,47821.348273,22229.926528,10105.0,34585.0,36234.0,64631.0,99960.0
monthly premium auto,1071.0,193.234360,1601.190369,61.0,68.0,83.0,109.5,35354.0
total claim amount,1071.0,404.528478,293.041850,0.0,201.5,354.0,532.0,2893.0
complaint_type1,1071.0,1.000000,0.000000,1.0,1.0,1.0,1.0,1.0
complaint_type2,1071.0,0.394024,0.883769,0.0,0.0,0.0,0.0,5.0
complaint_type3,1071.0,0.000000,0.000000,0.0,0.0,0.0,0.0,0.0

In [ ]:
# We create the pandas object with the customers for improving information.

customers_forimprov = data[(data['total claim amount']>532)&(data['customer lifetime value']<=401975)]

In [83]:
# We obtain descriptive statistics for both columns of this dataset.

customers_forimprov[['total claim amount', 'customer lifetime value']].describe().T

,count,mean,std,min,25%,50%,75%,max
total claim amount,38.0,718.789474,146.838974,537.0,632.25,685.0,797.25,1185.0
customer lifetime value,38.0,338379.473684,56613.826303,228759.0,294655.50,363799.0,385847.75,401654.0